hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_qeo_regs.h
/*
 * WAVE0_BELOW_MIN_LIMIT (RW)
 *
 * wave0 below min limit mode.
 * 0: output 0.
 * 1: output 0xffff.
 * 2: output as level_min_limit0.level1_min_limit
 */
#define QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_MASK (0x300U)
#define QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SHIFT (8U)
#define QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SET(x) (((uint32_t)(x) << QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SHIFT) & QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_MASK)
#define QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_GET(x) (((uint32_t)(x) & QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_MASK) >> QEO_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SHIFT)

/*
 * SADDLE_TYPE (RW)
 *
 * saddle type seclect;
 * 0:standard saddle.
 * 1: triple-cos saddle.
 */
#define QEO_WAVE_MODE_SADDLE_TYPE_MASK (0x80U)
#define QEO_WAVE_MODE_SADDLE_TYPE_SHIFT (7U)
#define QEO_WAVE_MODE_SADDLE_TYPE_SET(x) (((uint32_t)(x) << QEO_WAVE_MODE_SADDLE_TYPE_SHIFT) & QEO_WAVE_MODE_SADDLE_TYPE_MASK)
#define QEO_WAVE_MODE_SADDLE_TYPE_GET(x) (((uint32_t)(x) & QEO_WAVE_MODE_SADDLE_TYPE_MASK) >> QEO_WAVE_MODE_SADDLE_TYPE_SHIFT)

/*
 * EN_WAVE2_VD_VQ_INJECT (RW)
 *
 * wave2 VdVq inject enable.
 * 0: disable VdVq inject.
 * 1: enable VdVq inject.
 */
#define QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_MASK (0x40U)
#define QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_SHIFT (6U)
#define QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_SET(x) (((uint32_t)(x) << QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_SHIFT) & QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_MASK)
#define QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_GET(x) (((uint32_t)(x) & QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_MASK) >> QEO_WAVE_MODE_EN_WAVE2_VD_VQ_INJECT_SHIFT)

/*
 * EN_WAVE1_VD_VQ_INJECT (RW)
 *
 * wave1 VdVq inject enable.
 * 0: disable VdVq inject.
 * 1: enable VdVq inject.
 */
#define QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_MASK (0x20U)
#define QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_SHIFT (5U)
#define QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_SET(x) (((uint32_t)(x) << QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_SHIFT) & QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_MASK)
#define QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_GET(x) (((uint32_t)(x) & QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_MASK) >> QEO_WAVE_MODE_EN_WAVE1_VD_VQ_INJECT_SHIFT)

/*
 * EN_WAVE0_VD_VQ_INJECT (RW)
 *
 * wave0 VdVq inject enable.
 * 0: disable VdVq inject.
 * 1: enable VdVq inject.
 */
#define QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_MASK (0x10U)
#define QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_SHIFT (4U)
#define QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_SET(x) (((uint32_t)(x) << QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_SHIFT) & QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_MASK)
#define QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_GET(x) (((uint32_t)(x) & QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_MASK) >> QEO_WAVE_MODE_EN_WAVE0_VD_VQ_INJECT_SHIFT)

/*
 * WAVES_OUTPUT_TYPE (RW)
 *
 * wave0/1/2 output mode.
 * 0: cosine wave.
 * 1: saddle wave.
 * 2. abs cosine wave.
 * 3. saw wave
 */
#define QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_MASK (0x3U)
#define QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_SHIFT (0U)
#define QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_SET(x) (((uint32_t)(x) << QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_SHIFT) & QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_MASK)
#define QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_GET(x) (((uint32_t)(x) & QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_MASK) >> QEO_WAVE_MODE_WAVES_OUTPUT_TYPE_SHIFT)

/* Bitfield definition for register of struct WAVE: RESOLUTION */
/*
 * LINES (RW)
 *
 * wave0/1/2 resolution
 */
#define QEO_WAVE_RESOLUTION_LINES_MASK (0xFFFFFFFFUL)
#define QEO_WAVE_RESOLUTION_LINES_SHIFT (0U)
#define QEO_WAVE_RESOLUTION_LINES_SET(x) (((uint32_t)(x) << QEO_WAVE_RESOLUTION_LINES_SHIFT) & QEO_WAVE_RESOLUTION_LINES_MASK)
#define QEO_WAVE_RESOLUTION_LINES_GET(x) (((uint32_t)(x) & QEO_WAVE_RESOLUTION_LINES_MASK) >> QEO_WAVE_RESOLUTION_LINES_SHIFT)

/* Bitfield definition for register of struct WAVE: WAVE0 */
/*
 * VAL (RW)
 *
 * wave0 phase shifter value, default is 0x0. write other value will shift phase early as (cfg_value/2^16) period
 */
#define QEO_WAVE_PHASE_SHIFT_VAL_MASK (0xFFFFU)
#define QEO_WAVE_PHASE_SHIFT_VAL_SHIFT (0U)
#define QEO_WAVE_PHASE_SHIFT_VAL_SET(x) (((uint32_t)(x) << QEO_WAVE_PHASE_SHIFT_VAL_SHIFT) & QEO_WAVE_PHASE_SHIFT_VAL_MASK)
#define QEO_WAVE_PHASE_SHIFT_VAL_GET(x) (((uint32_t)(x) & QEO_WAVE_PHASE_SHIFT_VAL_MASK) >> QEO_WAVE_PHASE_SHIFT_VAL_SHIFT)

/* Bitfield definition for register of struct WAVE: WAVE0 */
/*
 * VQ_VAL (RW)
 *
 * Vq inject value
 */
#define QEO_WAVE_VD_VQ_INJECT_VQ_VAL_MASK (0xFFFF0000UL)
#define QEO_WAVE_VD_VQ_INJECT_VQ_VAL_SHIFT (16U)
#define QEO_WAVE_VD_VQ_INJECT_VQ_VAL_SET(x) (((uint32_t)(x) << QEO_WAVE_VD_VQ_INJECT_VQ_VAL_SHIFT) & QEO_WAVE_VD_VQ_INJECT_VQ_VAL_MASK)
#define QEO_WAVE_VD_VQ_INJECT_VQ_VAL_GET(x) (((uint32_t)(x) & QEO_WAVE_VD_VQ_INJECT_VQ_VAL_MASK) >> QEO_WAVE_VD_VQ_INJECT_VQ_VAL_SHIFT)

/*
 * VD_VAL (RW)
 *
 * Vd inject value
 */
#define QEO_WAVE_VD_VQ_INJECT_VD_VAL_MASK (0xFFFFU)
#define QEO_WAVE_VD_VQ_INJECT_VD_VAL_SHIFT (0U)
#define QEO_WAVE_VD_VQ_INJECT_VD_VAL_SET(x) (((uint32_t)(x) << QEO_WAVE_VD_VQ_INJECT_VD_VAL_SHIFT) & QEO_WAVE_VD_VQ_INJECT_VD_VAL_MASK)
#define QEO_WAVE_VD_VQ_INJECT_VD_VAL_GET(x) (((uint32_t)(x) & QEO_WAVE_VD_VQ_INJECT_VD_VAL_MASK) >> QEO_WAVE_VD_VQ_INJECT_VD_VAL_SHIFT)

/* Bitfield definition for register of struct WAVE: VD_VQ_LOAD */
/*
 * LOAD (WO)
 *
 * load wave0/1/2 vd vq value.  always read 0
 * 0: vd vq keep previous value.
 * 1: load wave0/1/2 vd vq value at sametime.
 */
#define QEO_WAVE_VD_VQ_LOAD_LOAD_MASK (0x1U)
#define QEO_WAVE_VD_VQ_LOAD_LOAD_SHIFT (0U)
#define QEO_WAVE_VD_VQ_LOAD_LOAD_SET(x) (((uint32_t)(x) << QEO_WAVE_VD_VQ_LOAD_LOAD_SHIFT) & QEO_WAVE_VD_VQ_LOAD_LOAD_MASK)
#define QEO_WAVE_VD_VQ_LOAD_LOAD_GET(x) (((uint32_t)(x) & QEO_WAVE_VD_VQ_LOAD_LOAD_MASK) >> QEO_WAVE_VD_VQ_LOAD_LOAD_SHIFT)

/* Bitfield definition for register of struct WAVE: WAVE0 */
/*
 * EN_SCAL (RW)
 *
 * enable wave amplitude scaling. 0: disable; 1: enable
 */
#define QEO_WAVE_AMPLITUDE_EN_SCAL_MASK (0x10000UL)
#define QEO_WAVE_AMPLITUDE_EN_SCAL_SHIFT (16U)
#define QEO_WAVE_AMPLITUDE_EN_SCAL_SET(x) (((uint32_t)(x) << QEO_WAVE_AMPLITUDE_EN_SCAL_SHIFT) & QEO_WAVE_AMPLITUDE_EN_SCAL_MASK)
#define QEO_WAVE_AMPLITUDE_EN_SCAL_GET(x) (((uint32_t)(x) & QEO_WAVE_AMPLITUDE_EN_SCAL_MASK) >> QEO_WAVE_AMPLITUDE_EN_SCAL_SHIFT)

