hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_qeo_regs.h
/*
 * B_TYPE (RW)
 *
 * wave_b type:
 * 0: Two-phase orthogonality wave_b.
 * 1: reverse wave of pulse/reverse type.
 * 2: down wave of up/down type.
 * 3: Three-phase orthogonality wave_b.
 */
#define QEO_ABZ_MODE_B_TYPE_MASK (0x30U)
#define QEO_ABZ_MODE_B_TYPE_SHIFT (4U)
#define QEO_ABZ_MODE_B_TYPE_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_B_TYPE_SHIFT) & QEO_ABZ_MODE_B_TYPE_MASK)
#define QEO_ABZ_MODE_B_TYPE_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_B_TYPE_MASK) >> QEO_ABZ_MODE_B_TYPE_SHIFT)

/*
 * A_TYPE (RW)
 *
 * wave_a type:
 * 0: Two-phase orthogonality wave_a.
 * 1: pulse wave of pulse/reverse type.
 * 2: up wave of up/down type.
 * 3: Three-phase orthogonality wave_a.
 */
#define QEO_ABZ_MODE_A_TYPE_MASK (0x3U)
#define QEO_ABZ_MODE_A_TYPE_SHIFT (0U)
#define QEO_ABZ_MODE_A_TYPE_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_A_TYPE_SHIFT) & QEO_ABZ_MODE_A_TYPE_MASK)
#define QEO_ABZ_MODE_A_TYPE_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_A_TYPE_MASK) >> QEO_ABZ_MODE_A_TYPE_SHIFT)

/* Bitfield definition for register of struct ABZ: RESOLUTION */
/*
 * LINES (RW)
 *
 * wave_a/b/z resolution
 */
#define QEO_ABZ_RESOLUTION_LINES_MASK (0xFFFFFFFFUL)
#define QEO_ABZ_RESOLUTION_LINES_SHIFT (0U)
#define QEO_ABZ_RESOLUTION_LINES_SET(x) (((uint32_t)(x) << QEO_ABZ_RESOLUTION_LINES_SHIFT) & QEO_ABZ_RESOLUTION_LINES_MASK)
#define QEO_ABZ_RESOLUTION_LINES_GET(x) (((uint32_t)(x) & QEO_ABZ_RESOLUTION_LINES_MASK) >> QEO_ABZ_RESOLUTION_LINES_SHIFT)

/* Bitfield definition for register of struct ABZ: A */
/*
 * VAL (RW)
 *
 * wave_a phase shifter value, default is 0x0. write other value will shift phase early as (cfg_value/2^16) period.
 */
#define QEO_ABZ_PHASE_SHIFT_VAL_MASK (0xFFFFU)
#define QEO_ABZ_PHASE_SHIFT_VAL_SHIFT (0U)
#define QEO_ABZ_PHASE_SHIFT_VAL_SET(x) (((uint32_t)(x) << QEO_ABZ_PHASE_SHIFT_VAL_SHIFT) & QEO_ABZ_PHASE_SHIFT_VAL_MASK)
#define QEO_ABZ_PHASE_SHIFT_VAL_GET(x) (((uint32_t)(x) & QEO_ABZ_PHASE_SHIFT_VAL_MASK) >> QEO_ABZ_PHASE_SHIFT_VAL_SHIFT)

/* Bitfield definition for register of struct ABZ: LINE_WIDTH */
/*
 * LINE (RW)
 *
 * the num of system clk by 1/4 period when using as Two-phase orthogonality.
 */
#define QEO_ABZ_LINE_WIDTH_LINE_MASK (0xFFFFFFFFUL)
#define QEO_ABZ_LINE_WIDTH_LINE_SHIFT (0U)
#define QEO_ABZ_LINE_WIDTH_LINE_SET(x) (((uint32_t)(x) << QEO_ABZ_LINE_WIDTH_LINE_SHIFT) & QEO_ABZ_LINE_WIDTH_LINE_MASK)
#define QEO_ABZ_LINE_WIDTH_LINE_GET(x) (((uint32_t)(x) & QEO_ABZ_LINE_WIDTH_LINE_MASK) >> QEO_ABZ_LINE_WIDTH_LINE_SHIFT)

/* Bitfield definition for register of struct ABZ: WDOG_WIDTH */
/*
 * WIDTH (RW)
 *
 * wave will step 1/4 line to reminder user QEO still in controlled if QEO has no any toggle after the num of wdog_width sys clk.
 */
#define QEO_ABZ_WDOG_WIDTH_WIDTH_MASK (0xFFFFFFFFUL)
#define QEO_ABZ_WDOG_WIDTH_WIDTH_SHIFT (0U)
#define QEO_ABZ_WDOG_WIDTH_WIDTH_SET(x) (((uint32_t)(x) << QEO_ABZ_WDOG_WIDTH_WIDTH_SHIFT) & QEO_ABZ_WDOG_WIDTH_WIDTH_MASK)
#define QEO_ABZ_WDOG_WIDTH_WIDTH_GET(x) (((uint32_t)(x) & QEO_ABZ_WDOG_WIDTH_WIDTH_MASK) >> QEO_ABZ_WDOG_WIDTH_WIDTH_SHIFT)

/* Bitfield definition for register of struct ABZ: POSTION_SYNC */
/*
 * POSTION (WO)
 *
 * load next valid postion into  abz owned postion.  always read 0
 * 0: sync abz owned postion with next valid postion.
 * 1: not sync.
 */
#define QEO_ABZ_POSTION_SYNC_POSTION_MASK (0x1U)
#define QEO_ABZ_POSTION_SYNC_POSTION_SHIFT (0U)
#define QEO_ABZ_POSTION_SYNC_POSTION_SET(x) (((uint32_t)(x) << QEO_ABZ_POSTION_SYNC_POSTION_SHIFT) & QEO_ABZ_POSTION_SYNC_POSTION_MASK)
#define QEO_ABZ_POSTION_SYNC_POSTION_GET(x) (((uint32_t)(x) & QEO_ABZ_POSTION_SYNC_POSTION_MASK) >> QEO_ABZ_POSTION_SYNC_POSTION_SHIFT)

/* Bitfield definition for register of struct PWM: MODE */
/*
 * PWM7_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEO_PWM_MODE_PWM7_SAFETY_MASK (0xC0000000UL)
#define QEO_PWM_MODE_PWM7_SAFETY_SHIFT (30U)
#define QEO_PWM_MODE_PWM7_SAFETY_SET(x) (((uint32_t)(x) << QEO_PWM_MODE_PWM7_SAFETY_SHIFT) & QEO_PWM_MODE_PWM7_SAFETY_MASK)
#define QEO_PWM_MODE_PWM7_SAFETY_GET(x) (((uint32_t)(x) & QEO_PWM_MODE_PWM7_SAFETY_MASK) >> QEO_PWM_MODE_PWM7_SAFETY_SHIFT)

/*
 * PWM6_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEO_PWM_MODE_PWM6_SAFETY_MASK (0x30000000UL)
#define QEO_PWM_MODE_PWM6_SAFETY_SHIFT (28U)
#define QEO_PWM_MODE_PWM6_SAFETY_SET(x) (((uint32_t)(x) << QEO_PWM_MODE_PWM6_SAFETY_SHIFT) & QEO_PWM_MODE_PWM6_SAFETY_MASK)
#define QEO_PWM_MODE_PWM6_SAFETY_GET(x) (((uint32_t)(x) & QEO_PWM_MODE_PWM6_SAFETY_MASK) >> QEO_PWM_MODE_PWM6_SAFETY_SHIFT)

/*
 * PWM5_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEO_PWM_MODE_PWM5_SAFETY_MASK (0xC000000UL)
#define QEO_PWM_MODE_PWM5_SAFETY_SHIFT (26U)
#define QEO_PWM_MODE_PWM5_SAFETY_SET(x) (((uint32_t)(x) << QEO_PWM_MODE_PWM5_SAFETY_SHIFT) & QEO_PWM_MODE_PWM5_SAFETY_MASK)
#define QEO_PWM_MODE_PWM5_SAFETY_GET(x) (((uint32_t)(x) & QEO_PWM_MODE_PWM5_SAFETY_MASK) >> QEO_PWM_MODE_PWM5_SAFETY_SHIFT)

/*
 * PWM4_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEO_PWM_MODE_PWM4_SAFETY_MASK (0x3000000UL)
#define QEO_PWM_MODE_PWM4_SAFETY_SHIFT (24U)
#define QEO_PWM_MODE_PWM4_SAFETY_SET(x) (((uint32_t)(x) << QEO_PWM_MODE_PWM4_SAFETY_SHIFT) & QEO_PWM_MODE_PWM4_SAFETY_MASK)
#define QEO_PWM_MODE_PWM4_SAFETY_GET(x) (((uint32_t)(x) & QEO_PWM_MODE_PWM4_SAFETY_MASK) >> QEO_PWM_MODE_PWM4_SAFETY_SHIFT)

/*
 * PWM3_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEO_PWM_MODE_PWM3_SAFETY_MASK (0xC00000UL)
#define QEO_PWM_MODE_PWM3_SAFETY_SHIFT (22U)
#define QEO_PWM_MODE_PWM3_SAFETY_SET(x) (((uint32_t)(x) << QEO_PWM_MODE_PWM3_SAFETY_SHIFT) & QEO_PWM_MODE_PWM3_SAFETY_MASK)
#define QEO_PWM_MODE_PWM3_SAFETY_GET(x) (((uint32_t)(x) & QEO_PWM_MODE_PWM3_SAFETY_MASK) >> QEO_PWM_MODE_PWM3_SAFETY_SHIFT)

/*
 * PWM2_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEO_PWM_MODE_PWM2_SAFETY_MASK (0x300000UL)
#define QEO_PWM_MODE_PWM2_SAFETY_SHIFT (20U)
#define QEO_PWM_MODE_PWM2_SAFETY_SET(x) (((uint32_t)(x) << QEO_PWM_MODE_PWM2_SAFETY_SHIFT) & QEO_PWM_MODE_PWM2_SAFETY_MASK)
#define QEO_PWM_MODE_PWM2_SAFETY_GET(x) (((uint32_t)(x) & QEO_PWM_MODE_PWM2_SAFETY_MASK) >> QEO_PWM_MODE_PWM2_SAFETY_SHIFT)

